Repository: kadamczak/MultiplayerGameBackend
Catalog: src/MultiplayerGameBackend.Infrastructure/Resources/SharedResources.*.resx
Languages: pl

# Error.SomethingWentWrong
source: Something went wrong.
pl: Coś poszło nie tak.

# Error.OneOrMoreConflicts
source: One or more conflicts occurred.
pl: Wystąpił jeden lub więcej konfliktów.

# Error.OneOrMoreErrors
source: One or more errors occurred.
pl: Wystąpił jeden lub więcej błędów.

# Error.UserMustBeAuthenticated
source: User must be authenticated.
pl: Użytkownik musi być uwierzytelniony.

# Error.InvalidCredentials
source: Invalid credentials.
pl: Nieprawidłowe dane uwierzytelniające.

# Error.InvalidToken
source: Invalid token.
pl: Nieprawidłowy token.

# Error.RefreshTokenExpired
source: Refresh token has expired.
pl: Token odświeżania wygasł.

# Error.UserAlreadyExists
source: User already exists.
pl: Użytkownik już istnieje.

# Error.EmailAlreadyConfirmed
source: Email is already confirmed.
pl: Email jest już potwierdzony.

# Error.EmailNotConfirmed
source: Email is not confirmed.
pl: Email nie jest potwierdzony.

# Error.TwoFactorNotEnabled
source: Two-factor authentication is not enabled.
pl: Uwierzytelnianie dwuskładnikowe nie jest włączone.

# Error.PasswordDoesNotMeetRequirements
source: Password does not meet requirements.
pl: Hasło nie spełnia wymagań.

# Error.PasswordIncorrect
source: Password is incorrect.
pl: Hasło jest nieprawidłowe.

# Error.CannotSendFriendRequestToYourself
source: You cannot send a friend request to yourself.
pl: Nie możesz wysłać zaproszenia do znajomych do samego siebie.

# Error.AlreadyFriends
source: You are already friends with this user.
pl: Jesteś już znajomym z tym użytkownikiem.

# Error.PendingFriendRequestExists
source: A pending friend request already exists between you and this user.
pl: Istnieje już oczekujące zaproszenie do znajomych między tobą a tym użytkownikiem.

# Error.MaxPendingRequestsReached
source: You have reached the maximum number of pending friend requests ({0}).
pl: Osiągnąłeś maksymalną liczbę oczekujących zaproszeń do znajomych ({0}).

# Error.MaxFriendsReached
source: You have reached the maximum number of friends ({0}).
pl: Osiągnąłeś maksymalną liczbę znajomych ({0}).

# Error.RequesterMaxFriendsReached
source: The requester has reached the maximum number of friends ({0}).
pl: Wysyłający osiągnął maksymalną liczbę znajomych ({0}).

# Error.FriendRequestAlreadyResponded
source: This friend request has already been responded to.
pl: Na to zaproszenie do znajomych już udzielono odpowiedzi.

# Error.CanOnlyAcceptRequestsSentToYou
source: You can only accept friend requests sent to you.
pl: Możesz zaakceptować tylko zaproszenia wysłane do ciebie.

# Error.CanOnlyRejectRequestsSentToYou
source: You can only reject friend requests sent to you.
pl: Możesz odrzucić tylko zaproszenia wysłane do ciebie.

# Error.CanOnlyCancelPendingRequests
source: You can only cancel pending friend requests.
pl: Możesz anulować tylko oczekujące zaproszenia do znajomych.

# Error.CanOnlyCancelOwnRequests
source: You can only cancel friend requests that you sent.
pl: Możesz anulować tylko zaproszenia, które sam wysłałeś.

# Error.InvalidFriendUserId
source: Invalid friend user ID.
pl: Nieprawidłowy identyfikator użytkownika znajomego.

# Error.NoFileUploaded
source: No file uploaded.
pl: Nie przesłano pliku.

# Error.CannotEquipItemsNotOwned
source: Cannot equip items that don't belong to you.
pl: Nie możesz założyć przedmiotów, które do ciebie nie należą.

# Error.CannotBuyOwnOffer
source: You cannot buy your own offer.
pl: Nie możesz kupić własnej oferty.

# Error.InsufficientBalance
source: Insufficient balance.
pl: Niewystarczające środki.

# Error.CannotUpdateSoldOffer
source: Cannot update an offer that has already been sold.
pl: Nie można zaktualizować oferty, która została już sprzedana.

# Error.CannotCancelSoldOffer
source: Cannot cancel an offer that has already been sold.
pl: Nie można anulować oferty, która została już sprzedana.

# Error.DoNotOwnItem
source: You do not own this item.
pl: Nie jesteś właścicielem tego przedmiotu.

# Error.DoNotOwnOffer
source: You do not own this offer.
pl: Nie jesteś właścicielem tej oferty.

# Error.CannotAffordMerchantOffer
source: You cannot afford this offer.
pl: Nie stać cię na tę ofertę.

# Error.NotFound
source: {0} with {1} '{2}' was not found.
pl: {0} z {1} '{2}' nie został znaleziony.

# Error.Conflict.EntityExists
source: {0} with this {1} already exists.
pl: {0} z tym {1} już istnieje.

# Error.UsernameAlreadyExists
source: This username already exists.
pl: Ta nazwa użytkownika już istnieje.

# Error.EmailAlreadyExists
source: This email already exists.
pl: Ten adres email już istnieje.

# Error.UserItemOfferAlreadyExists
source: An active offer already exists for this item.
pl: Aktywna oferta dla tego przedmiotu już istnieje.

# Error.UserNotFound
source: User not found.
pl: Użytkownik nie został znaleziony.

# Error.ReceiverNotFound
source: Receiver not found.
pl: Odbiorca nie został znaleziony.

# Error.ItemNotFound
source: Item not found.
pl: Przedmiot nie został znaleziony.

# Error.UserItemNotFound
source: User item not found.
pl: Przedmiot użytkownika nie został znaleziony.

# Error.UserItemOfferNotFound
source: User item offer not found.
pl: Oferta przedmiotu użytkownika nie została znaleziona.

# Error.MerchantItemOfferNotFound
source: Merchant item offer not found.
pl: Oferta kupca nie została znaleziona.

# Error.MerchantNotFound
source: Merchant not found.
pl: Kupiec nie został znaleziony.

# Error.FriendRequestNotFound
source: Friend request not found.
pl: Zaproszenie do znajomych nie zostało znalezione.

# Error.RoleNotFound
source: Role not found.
pl: Rola nie została znaleziona.

# Error.UserCustomizationNotFound
source: User customization not found.
pl: Personalizacja użytkownika nie została znaleziona.

# Error.ProfilePictureNotSet
source: Profile picture is not set.
pl: Zdjęcie profilowe nie jest ustawione.

# Validation.Required
source: The {0} field is required.
pl: Pole {0} jest wymagane.

# Validation.InvalidEmail
source: Invalid email address.
pl: Nieprawidłowy adres email.

# Validation.StringLength
source: The {0} must be between {2} and {1} characters.
pl: {0} musi mieć długość od {2} do {1} znaków.

# Validation.MinLength
source: The {0} must be at least {1} characters.
pl: {0} musi mieć co najmniej {1} znaków.

# Validation.MaxLength
source: The {0} must be at most {1} characters.
pl: {0} może mieć maksymalnie {1} znaków.

# Validation.Range
source: The {0} must be between {1} and {2}.
pl: {0} musi być w zakresie od {1} do {2}.

# Validation.InvalidValue
source: Invalid value for {0}.
pl: Nieprawidłowa wartość dla {0}.

# Validation.SortByMustBeOneOf
source: SortBy must be one of: {0}.
pl: Sortowanie musi być jedną z wartości: {0}.

# Validation.PageSizeMustBeOneOf
source: PageSize must be one of: {0}.
pl: Rozmiar strony musi być jedną z wartości: {0}.

# Validation.SearchPhraseTooLong
source: SearchPhrase must not exceed {0} characters.
pl: Hasło wyszukiwania nie może przekraczać {0} znaków.

# Validation.PasswordsDoNotMatch
source: Passwords do not match.
pl: Hasła nie są zgodne.

# Validation.InvalidPageNumber
source: PageNumber must be greater than 0.
pl: PageNumber musi być większy niż 0.

# Validation.CurrentPasswordRequired
source: Current password is required.
pl: Obecne hasło jest wymagane.

# Validation.NewPasswordRequired
source: New password is required.
pl: Nowe hasło jest wymagane.

# Validation.PasswordLength
source: Password must be between {0} and {1} characters long.
pl: Hasło musi mieć długość od {0} do {1} znaków.

# Validation.PasswordMustContainUppercase
source: Password must contain at least one uppercase letter.
pl: Hasło musi zawierać co najmniej jedną wielką literę.

# Validation.PasswordMustContainLowercase
source: Password must contain at least one lowercase letter.
pl: Hasło musi zawierać co najmniej jedną małą literę.

# Validation.PasswordMustContainDigit
source: Password must contain at least one digit.
pl: Hasło musi zawierać co najmniej jedną cyfrę.

# Validation.UsernameRequired
source: Username is required.
pl: Nazwa użytkownika jest wymagana.

# Validation.UsernameLength
source: Username must be between {0} and {1} characters long.
pl: Nazwa użytkownika musi mieć długość od {0} do {1} znaków.

# Validation.EmailRequired
source: Email is required.
pl: Email jest wymagany.

# Validation.PasswordRequired
source: Password is required.
pl: Hasło jest wymagane.

# Validation.ConfirmPasswordRequired
source: Confirm password is required.
pl: Potwierdzenie hasła jest wymagane.

# Validation.RoleNameRequired
source: Role name is required.
pl: Nazwa roli jest wymagana.

# Validation.NameRequired
source: Name is required.
pl: Nazwa jest wymagana.

# Validation.NameLength
source: Name must be between {0} and {1} characters long.
pl: Nazwa musi mieć długość od {0} do {1} znaków.

# Validation.DescriptionRequired
source: Description is required.
pl: Opis jest wymagany.

# Validation.DescriptionLength
source: Description must be between {0} and {1} characters long.
pl: Opis musi mieć długość od {0} do {1} znaków.

# Validation.TypeRequired
source: Type is required.
pl: Typ jest wymagany.

# Validation.SortDirectionRequired
source: Sort Direction needs to be either 'Ascending' or 'Descending'.
pl: Kierunek sortowania musi być 'Rosnący' lub 'Malejący'.

# Entity.User
source: User
pl: Użytkownik

# Entity.Item
source: Item
pl: Przedmiot

# Entity.UserItem
source: User Item
pl: Przedmiot użytkownika

# Entity.UserItemOffer
source: User Item Offer
pl: Oferta przedmiotu użytkownika

# Entity.MerchantItemOffer
source: Merchant Item Offer
pl: Oferta kupca

# Entity.InGameMerchant
source: Merchant
pl: Kupiec

# Entity.FriendRequest
source: Friend Request
pl: Zaproszenie do znajomych

# Entity.Role
source: Role
pl: Rola
